/******************** Copyright (c) 2012-2013. All rights reserved *************
  File Name  :  tn_config.c
  Author     :  Koshkin Sergey
  Version    :  1.00
  Date       :  20/04/2013
  Description:  

  This software is supplied "AS IS" without warranties of any kind.

*******************************************************************************/

#include <tn.h>

tn_stack_t tn_timer_task_stack[128];
tn_stack_t tn_idle_task_stack[64];

/*-----------------------------------------------------------------------------*
 * Название : tn_idle_task_func
 * Описание : Это функция задачи idle, которая всегда находится в статусе
 *            RUNNABLE.
 * Параметры: par - Всегда имеет значение 0.
 * Результат: Нет.
 *----------------------------------------------------------------------------*/
TASK_FUNC tn_idle_task_func(void *par)
{
  /* Инициализируем и запускаем сторожевой таймер */
  iwdt_init();

  for(;;) {
    /* Перезагрузка сторожевого таймера */
    iwdt_reload();
    __wfi();
  }
}

/*-----------------------------------------------------------------------------*
 * Название : tn_systick_init
 * Описание : Конфигурирует  и включает системный таймер в системе.
 * Параметры: hz - Частота системного таймера.
 * Результат: Нет
 *----------------------------------------------------------------------------*/
void tn_systick_init(unsigned int hz)
{
  RCC_ClocksTypeDef RCC_Clocks;

  /* Включаем прерывание системного таймера именно здесь, после инициализации
     всех сервисов RTOS */
  RCC_GetClocksFreq(&RCC_Clocks);
  SysTick_Config(RCC_Clocks.HCLK_Frequency/hz);
}

/*-----------------------------------------------------------------------------*
  Название :  SysTick_Handler
  Описание :  Обработчик прерывания системного таймера вызывается каждую 1 мс.
              Используется для генерации тиков операционной и графической систем.
  Параметры:  Нет
  Результат:  Нет
*-----------------------------------------------------------------------------*/
void SysTick_Handler(void)
{
  tn_timer();
}

/*------------------------------ Конец файла ---------------------------------*/
